Revit 2024 API
AnalysisDisplayStyleColorSettingsType Enumeration
 Defines types for color settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Since: 2011
Syntax
C#
public enum AnalysisDisplayStyleColorSettingsType
Visual Basic
Public Enumeration AnalysisDisplayStyleColorSettingsType
Visual C++
public enum class AnalysisDisplayStyleColorSettingsType
Members
Member name | Description
GradientColor |  Intermediate and min/max color settings are used to interpolate color for values between adjacent entries.
SolidColorRanges |  Intermediate and min/max color settings define ranges in which the color is constant.
See Also
Autodesk.Revit.DB.Analysis Namespace